###############################################################
#  Generated by:      Cadence Innovus 20.10-p004_1
#  OS:                Linux x86_64(Host ID cad29)
#  Generated on:      Tue Dec 28 22:34:44 2021
#  Design:            ipdc
#  Command:           routeDesign -globalDetail -viaOpt -wireOpt
###############################################################
current_design ipdc
create_clock [get_ports {i_clk}]  -name i_clk -period 6.800000 -waveform {0.000000 3.400000}
set_propagated_clock  [get_ports {i_clk}]
set_max_fanout 20  [get_ports {i_clk}]
set_max_fanout 20  [get_ports {i_rst_n}]
set_max_fanout 20  [get_ports {i_op_valid}]
set_max_fanout 20  [get_ports {i_op_mode[3]}]
set_max_fanout 20  [get_ports {i_op_mode[2]}]
set_max_fanout 20  [get_ports {i_op_mode[1]}]
set_max_fanout 20  [get_ports {i_op_mode[0]}]
set_load -pin_load -max  0.05  [get_ports {o_op_ready}]
set_load -pin_load -min  0.05  [get_ports {o_op_ready}]
set_max_fanout 20  [get_ports {i_in_valid}]
set_max_fanout 20  [get_ports {i_in_data[23]}]
set_max_fanout 20  [get_ports {i_in_data[22]}]
set_max_fanout 20  [get_ports {i_in_data[21]}]
set_max_fanout 20  [get_ports {i_in_data[20]}]
set_max_fanout 20  [get_ports {i_in_data[19]}]
set_max_fanout 20  [get_ports {i_in_data[18]}]
set_max_fanout 20  [get_ports {i_in_data[17]}]
set_max_fanout 20  [get_ports {i_in_data[16]}]
set_max_fanout 20  [get_ports {i_in_data[15]}]
set_max_fanout 20  [get_ports {i_in_data[14]}]
set_max_fanout 20  [get_ports {i_in_data[13]}]
set_max_fanout 20  [get_ports {i_in_data[12]}]
set_max_fanout 20  [get_ports {i_in_data[11]}]
set_max_fanout 20  [get_ports {i_in_data[10]}]
set_max_fanout 20  [get_ports {i_in_data[9]}]
set_max_fanout 20  [get_ports {i_in_data[8]}]
set_max_fanout 20  [get_ports {i_in_data[7]}]
set_max_fanout 20  [get_ports {i_in_data[6]}]
set_max_fanout 20  [get_ports {i_in_data[5]}]
set_max_fanout 20  [get_ports {i_in_data[4]}]
set_max_fanout 20  [get_ports {i_in_data[3]}]
set_max_fanout 20  [get_ports {i_in_data[2]}]
set_max_fanout 20  [get_ports {i_in_data[1]}]
set_max_fanout 20  [get_ports {i_in_data[0]}]
set_load -pin_load -max  0.05  [get_ports {o_in_ready}]
set_load -pin_load -min  0.05  [get_ports {o_in_ready}]
set_load -pin_load -max  0.05  [get_ports {o_out_valid}]
set_load -pin_load -min  0.05  [get_ports {o_out_valid}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[23]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[23]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[22]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[22]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[21]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[21]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[20]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[20]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[19]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[19]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[18]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[18]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[17]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[17]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[16]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[16]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[15]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[15]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[14]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[14]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[13]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[13]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[12]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[12]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[11]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[11]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[10]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[10]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[9]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[9]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[8]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[8]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[7]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[7]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[6]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[6]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[5]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[5]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[4]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[4]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[3]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[3]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[2]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[2]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[1]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[1]}]
set_load -pin_load -max  0.05  [get_ports {o_out_data[0]}]
set_load -pin_load -min  0.05  [get_ports {o_out_data[0]}]
set_wire_load_model -library slow -max -name tsmc13_wl10
set_wire_load_model -library slow -min -name tsmc13_wl10
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[20]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[13]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[9]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_valid}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[11]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[7]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[5]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_op_valid}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[2]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[3]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[0]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[1]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[18]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[23]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[16]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[21]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[14]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[12]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[8]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[10]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[6]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[3]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[4]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[1]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[2]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_rst_n}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[0]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[19]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[17]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[22]}]
set_input_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {i_in_data[15]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[18]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[23]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[16]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[21]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[14]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[12]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[10]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[9]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[7]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_in_ready}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[5]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[3]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_op_ready}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[1]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[19]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[17]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[22]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[15]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_valid}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[20]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[13]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[11]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[8]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[6]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[4]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[2]}]
set_output_delay -add_delay 3.4 -clock [get_clocks {i_clk}] [get_ports {o_out_data[0]}]
set __coll_2 [get_pins {mem_mem3/CEN mem_mem3/WEN mem_mem3/A[7] mem_mem3/A[6] mem_mem3/A[5] mem_mem3/A[4] mem_mem3/A[3] mem_mem3/A[2] mem_mem3/A[1] mem_mem3/A[0] mem_mem3/D[7] mem_mem3/D[6] mem_mem3/D[5] mem_mem3/D[4] mem_mem3/D[3] mem_mem3/D[2] mem_mem3/D[1] mem_mem3/D[0] mem_mem2/CEN mem_mem2/WEN mem_mem2/A[7] mem_mem2/A[6] mem_mem2/A[5] mem_mem2/A[4] mem_mem2/A[3] mem_mem2/A[2] mem_mem2/A[1] mem_mem2/A[0] mem_mem2/D[7] mem_mem2/D[6] mem_mem2/D[5] mem_mem2/D[4] mem_mem2/D[3] mem_mem2/D[2] mem_mem2/D[1] mem_mem2/D[0] mem_mem1/CEN mem_mem1/WEN mem_mem1/A[7] mem_mem1/A[6] mem_mem1/A[5] mem_mem1/A[4] mem_mem1/A[3] mem_mem1/A[2] mem_mem1/A[1] mem_mem1/A[0] mem_mem1/D[7] mem_mem1/D[6] mem_mem1/D[5] mem_mem1/D[4] mem_mem1/D[3] mem_mem1/D[2] mem_mem1/D[1] mem_mem1/D[0] img_origin_r_reg_0_/D img_origin_r_reg_0_/RN img_size_r_reg_3_/D img_size_r_reg_3_/RN cstate_reg_0_/D cstate_reg_0_/RN img_size_r_reg_2_/D img_size_r_reg_2_/RN img_size_r_reg_1_/D img_size_r_reg_1_/RN img_size_r_reg_0_/D img_size_r_reg_0_/RN img_origin_r_reg_3_/D img_origin_r_reg_3_/RN img_origin_r_reg_4_/D img_origin_r_reg_4_/RN img_origin_r_reg_5_/D img_origin_r_reg_5_/RN img_origin_r_reg_6_/D img_origin_r_reg_6_/RN counter_r_reg_2_/D counter_r_reg_2_/RN counter_r_reg_4_/D counter_r_reg_4_/RN counter_r_reg_6_/D counter_r_reg_6_/RN counter_r_reg_7_/D counter_r_reg_7_/RN out_data_r_reg_0_/D out_data_r_reg_0_/RN out_data_r_reg_1_/D out_data_r_reg_1_/RN out_data_r_reg_2_/D out_data_r_reg_2_/RN out_data_r_reg_3_/D out_data_r_reg_3_/RN out_data_r_reg_4_/D out_data_r_reg_4_/RN out_data_r_reg_6_/D out_data_r_reg_6_/RN out_data_r_reg_8_/D out_data_r_reg_8_/RN out_data_r_reg_9_/D out_data_r_reg_9_/RN out_data_r_reg_10_/D out_data_r_reg_10_/RN out_data_r_reg_11_/D out_data_r_reg_11_/RN out_data_r_reg_12_/D out_data_r_reg_12_/RN out_data_r_reg_13_/D out_data_r_reg_13_/RN out_data_r_reg_14_/D out_data_r_reg_14_/RN out_data_r_reg_15_/D out_data_r_reg_15_/RN out_data_r_reg_16_/D out_data_r_reg_16_/RN out_data_r_reg_17_/D out_data_r_reg_17_/RN out_data_r_reg_18_/D out_data_r_reg_18_/RN out_data_r_reg_19_/D out_data_r_reg_19_/RN out_data_r_reg_20_/D out_data_r_reg_20_/RN out_data_r_reg_21_/D out_data_r_reg_21_/RN out_data_r_reg_22_/D out_data_r_reg_22_/RN out_data_r_reg_23_/D out_data_r_reg_23_/RN counter_r_reg_8_/D counter_r_reg_8_/RN census_b_reg_0_/D census_b_reg_0_/RN census_b_reg_1_/D census_b_reg_1_/RN census_b_reg_2_/D census_b_reg_2_/RN census_b_reg_3_/D census_b_reg_3_/RN census_b_reg_4_/D census_b_reg_4_/RN census_b_reg_5_/D census_b_reg_5_/RN census_b_reg_6_/D census_b_reg_6_/RN census_b_reg_7_/D census_b_reg_7_/RN census_g_reg_0_/D census_g_reg_0_/RN census_g_reg_1_/D census_g_reg_1_/RN census_g_reg_2_/D census_g_reg_2_/RN census_g_reg_3_/D census_g_reg_3_/RN census_g_reg_4_/D census_g_reg_4_/RN census_g_reg_5_/D census_g_reg_5_/RN census_g_reg_6_/D census_g_reg_6_/RN census_g_reg_7_/D census_g_reg_7_/RN census_r_reg_0_/D census_r_reg_0_/RN census_r_reg_1_/D census_r_reg_1_/RN census_r_reg_2_/D census_r_reg_2_/RN census_r_reg_3_/D census_r_reg_3_/RN census_r_reg_4_/D census_r_reg_4_/RN census_r_reg_5_/D census_r_reg_5_/RN census_r_reg_6_/D census_r_reg_6_/RN census_r_reg_7_/D census_r_reg_7_/RN valid_r_reg/D valid_r_reg/RN m_reg_r_reg_4__7_/D m_reg_r_reg_4__7_/RN m_reg_r_reg_2__7_/D m_reg_r_reg_2__7_/RN m_reg_r_reg_1__7_/D m_reg_r_reg_1__7_/RN m_reg_r_reg_4__6_/D m_reg_r_reg_4__6_/RN m_reg_r_reg_2__6_/D m_reg_r_reg_2__6_/RN m_reg_r_reg_1__6_/D m_reg_r_reg_1__6_/RN m_reg_r_reg_4__5_/D m_reg_r_reg_4__5_/RN m_reg_r_reg_2__5_/D m_reg_r_reg_2__5_/RN m_reg_r_reg_1__5_/D m_reg_r_reg_1__5_/RN m_reg_r_reg_4__4_/D m_reg_r_reg_4__4_/RN m_reg_r_reg_2__4_/D m_reg_r_reg_2__4_/RN m_reg_r_reg_1__4_/D m_reg_r_reg_1__4_/RN m_reg_r_reg_4__3_/D m_reg_r_reg_4__3_/RN m_reg_r_reg_2__3_/D m_reg_r_reg_2__3_/RN m_reg_r_reg_1__3_/D m_reg_r_reg_1__3_/RN m_reg_r_reg_4__2_/D m_reg_r_reg_4__2_/RN m_reg_r_reg_2__2_/D m_reg_r_reg_2__2_/RN m_reg_r_reg_1__2_/D m_reg_r_reg_1__2_/RN m_reg_r_reg_4__1_/D m_reg_r_reg_4__1_/RN m_reg_r_reg_2__1_/D m_reg_r_reg_2__1_/RN m_reg_r_reg_1__1_/D m_reg_r_reg_1__1_/RN m_reg_r_reg_4__0_/D m_reg_r_reg_4__0_/RN m_reg_r_reg_2__0_/D m_reg_r_reg_2__0_/RN m_reg_r_reg_1__0_/D m_reg_r_reg_1__0_/RN m_reg_g_reg_4__7_/D m_reg_g_reg_4__7_/RN m_reg_g_reg_4__6_/D m_reg_g_reg_4__6_/RN m_reg_g_reg_3__6_/D m_reg_g_reg_3__6_/RN m_reg_g_reg_4__5_/D m_reg_g_reg_4__5_/RN m_reg_g_reg_4__4_/D m_reg_g_reg_4__4_/RN m_reg_g_reg_4__3_/D m_reg_g_reg_4__3_/RN m_reg_g_reg_4__2_/D m_reg_g_reg_4__2_/RN m_reg_g_reg_4__1_/D m_reg_g_reg_4__1_/RN m_reg_g_reg_4__0_/D m_reg_g_reg_4__0_/RN m_reg_g_reg_3__0_/D m_reg_g_reg_3__0_/RN m_reg_b_reg_4__7_/D m_reg_b_reg_4__7_/RN m_reg_b_reg_4__6_/D m_reg_b_reg_4__6_/RN m_reg_b_reg_4__5_/D m_reg_b_reg_4__5_/RN m_reg_b_reg_4__4_/D m_reg_b_reg_4__4_/RN m_reg_b_reg_4__3_/D m_reg_b_reg_4__3_/RN m_reg_b_reg_4__2_/D m_reg_b_reg_4__2_/RN m_reg_b_reg_4__1_/D m_reg_b_reg_4__1_/RN m_reg_b_reg_4__0_/D m_reg_b_reg_4__0_/RN cstate_reg_1_/D cstate_reg_1_/SN m_reg_g_reg_1__6_/D m_reg_g_reg_1__6_/RN m_reg_g_reg_1__5_/D m_reg_g_reg_1__5_/RN m_reg_g_reg_1__7_/D m_reg_g_reg_1__7_/RN m_reg_r_reg_3__7_/D m_reg_r_reg_3__7_/RN m_reg_g_reg_3__7_/D m_reg_g_reg_3__7_/RN m_reg_g_reg_2__7_/D m_reg_g_reg_2__7_/RN m_reg_g_reg_1__4_/D m_reg_g_reg_1__4_/RN m_reg_r_reg_3__5_/D m_reg_r_reg_3__5_/RN m_reg_r_reg_3__6_/D m_reg_r_reg_3__6_/RN m_reg_b_reg_2__7_/D m_reg_b_reg_2__7_/RN m_reg_g_reg_3__5_/D m_reg_g_reg_3__5_/RN m_reg_g_reg_2__5_/D m_reg_g_reg_2__5_/RN m_reg_b_reg_3__7_/D m_reg_b_reg_3__7_/RN m_reg_g_reg_3__4_/D m_reg_g_reg_3__4_/RN m_reg_g_reg_2__6_/D m_reg_g_reg_2__6_/RN m_reg_b_reg_3__5_/D m_reg_b_reg_3__5_/RN m_reg_b_reg_3__6_/D m_reg_b_reg_3__6_/RN m_reg_r_reg_3__4_/D m_reg_r_reg_3__4_/RN m_reg_b_reg_2__5_/D m_reg_b_reg_2__5_/RN m_reg_g_reg_2__4_/D m_reg_g_reg_2__4_/RN valid_rr_reg/D valid_rr_reg/RN m_reg_b_reg_3__4_/D m_reg_b_reg_3__4_/RN m_reg_b_reg_2__6_/D m_reg_b_reg_2__6_/RN m_reg_g_reg_2__3_/D m_reg_g_reg_2__3_/RN m_reg_g_reg_1__3_/D m_reg_g_reg_1__3_/RN m_reg_g_reg_3__3_/D m_reg_g_reg_3__3_/RN m_reg_g_reg_2__2_/D m_reg_g_reg_2__2_/RN m_reg_g_reg_1__2_/D m_reg_g_reg_1__2_/RN m_reg_b_reg_2__4_/D m_reg_b_reg_2__4_/RN m_reg_g_reg_3__2_/D m_reg_g_reg_3__2_/RN m_reg_b_reg_3__3_/D m_reg_b_reg_3__3_/RN m_reg_g_reg_1__0_/D m_reg_g_reg_1__0_/RN m_reg_b_reg_3__2_/D m_reg_b_reg_3__2_/RN m_reg_g_reg_1__1_/D m_reg_g_reg_1__1_/RN m_reg_r_reg_3__3_/D m_reg_r_reg_3__3_/RN m_reg_r_reg_3__2_/D m_reg_r_reg_3__2_/RN m_reg_g_reg_3__1_/D m_reg_g_reg_3__1_/RN m_reg_r_reg_3__0_/D m_reg_r_reg_3__0_/RN m_reg_b_reg_2__3_/D m_reg_b_reg_2__3_/RN m_reg_g_reg_2__0_/D m_reg_g_reg_2__0_/RN m_reg_g_reg_0__7_/D m_reg_g_reg_0__7_/RN m_reg_g_reg_2__1_/D m_reg_g_reg_2__1_/RN m_reg_b_reg_0__7_/D m_reg_b_reg_0__7_/RN m_reg_b_reg_2__2_/D m_reg_b_reg_2__2_/RN m_reg_r_reg_3__1_/D m_reg_r_reg_3__1_/RN m_reg_b_reg_3__0_/D m_reg_b_reg_3__0_/RN m_reg_b_reg_3__1_/D m_reg_b_reg_3__1_/RN m_reg_b_reg_2__0_/D m_reg_b_reg_2__0_/RN m_reg_r_reg_0__0_/D m_reg_r_reg_0__0_/RN m_reg_g_reg_0__0_/D m_reg_g_reg_0__0_/RN m_reg_b_reg_0__0_/D m_reg_b_reg_0__0_/RN m_reg_r_reg_0__5_/D m_reg_r_reg_0__5_/RN m_reg_b_reg_0__5_/D m_reg_b_reg_0__5_/RN m_reg_g_reg_0__5_/D m_reg_g_reg_0__5_/RN m_reg_b_reg_2__1_/D m_reg_b_reg_2__1_/RN m_reg_r_reg_0__1_/D m_reg_r_reg_0__1_/RN m_reg_b_reg_0__1_/D m_reg_b_reg_0__1_/RN m_reg_g_reg_0__1_/D m_reg_g_reg_0__1_/RN m_reg_r_reg_0__3_/D m_reg_r_reg_0__3_/RN m_reg_g_reg_0__3_/D m_reg_g_reg_0__3_/RN m_reg_b_reg_0__3_/D m_reg_b_reg_0__3_/RN m_reg_b_reg_0__2_/D m_reg_b_reg_0__2_/RN}]
append_to_collection __coll_2 [get_pins {m_reg_r_reg_0__2_/D m_reg_r_reg_0__2_/RN m_reg_g_reg_0__2_/D m_reg_g_reg_0__2_/RN m_reg_r_reg_0__4_/D m_reg_r_reg_0__4_/RN m_reg_b_reg_0__4_/D m_reg_b_reg_0__4_/RN m_reg_g_reg_0__4_/D m_reg_g_reg_0__4_/RN m_reg_r_reg_0__6_/D m_reg_r_reg_0__6_/RN m_reg_g_reg_0__6_/D m_reg_g_reg_0__6_/RN m_reg_b_reg_0__6_/D m_reg_b_reg_0__6_/RN m_reg_r_reg_0__7_/D m_reg_r_reg_0__7_/RN ftr_cnt2_reg_1_/D ftr_cnt2_reg_1_/RN ftr_cnt2_reg_0_/D ftr_cnt2_reg_0_/RN ftr_row_reg_1_/D ftr_row_reg_1_/RN img_size_r_reg_4_/D img_size_r_reg_4_/RN counter_r_reg_0_/D counter_r_reg_0_/RN m_reg_b_reg_1__7_/D m_reg_b_reg_1__7_/RN m_reg_b_reg_1__4_/D m_reg_b_reg_1__4_/RN m_reg_b_reg_1__2_/D m_reg_b_reg_1__2_/RN m_reg_b_reg_1__1_/D m_reg_b_reg_1__1_/RN ftr_zero_pad_r_reg/D ftr_zero_pad_r_reg/RN img_origin_r_reg_7_/D img_origin_r_reg_7_/RN counter_r_reg_1_/D counter_r_reg_1_/RN counter_r_reg_5_/D counter_r_reg_5_/RN cstate_reg_2_/D cstate_reg_2_/RN m_reg_b_reg_1__5_/D m_reg_b_reg_1__5_/RN m_reg_b_reg_1__6_/D m_reg_b_reg_1__6_/RN m_reg_b_reg_1__3_/D m_reg_b_reg_1__3_/RN m_reg_b_reg_1__0_/D m_reg_b_reg_1__0_/RN out_data_r_reg_5_/D out_data_r_reg_5_/RN out_data_r_reg_7_/D out_data_r_reg_7_/RN cstate_reg_3_/D cstate_reg_3_/SN img_origin_r_reg_2_/D img_origin_r_reg_2_/RN ftr_row_reg_0_/D ftr_col_reg_0_/D ftr_cnt_reg_1_/D ftr_cnt_reg_0_/D ftr_row_reg_2_/D ftr_col_reg_1_/D ftr_col_reg_2_/D counter_r_reg_3_/D counter_r_reg_3_/RN img_origin_r_reg_1_/D img_origin_r_reg_1_/RN}]
group_path -name reg2reg -from [get_pins {mem_mem3/CLK mem_mem2/CLK mem_mem1/CLK img_origin_r_reg_0_/CK img_size_r_reg_3_/CK cstate_reg_0_/CK img_size_r_reg_2_/CK img_size_r_reg_1_/CK img_size_r_reg_0_/CK img_origin_r_reg_3_/CK img_origin_r_reg_4_/CK img_origin_r_reg_5_/CK img_origin_r_reg_6_/CK counter_r_reg_2_/CK counter_r_reg_4_/CK counter_r_reg_6_/CK counter_r_reg_7_/CK out_data_r_reg_0_/CK out_data_r_reg_1_/CK out_data_r_reg_2_/CK out_data_r_reg_3_/CK out_data_r_reg_4_/CK out_data_r_reg_6_/CK out_data_r_reg_8_/CK out_data_r_reg_9_/CK out_data_r_reg_10_/CK out_data_r_reg_11_/CK out_data_r_reg_12_/CK out_data_r_reg_13_/CK out_data_r_reg_14_/CK out_data_r_reg_15_/CK out_data_r_reg_16_/CK out_data_r_reg_17_/CK out_data_r_reg_18_/CK out_data_r_reg_19_/CK out_data_r_reg_20_/CK out_data_r_reg_21_/CK out_data_r_reg_22_/CK out_data_r_reg_23_/CK counter_r_reg_8_/CK census_b_reg_0_/CK census_b_reg_1_/CK census_b_reg_2_/CK census_b_reg_3_/CK census_b_reg_4_/CK census_b_reg_5_/CK census_b_reg_6_/CK census_b_reg_7_/CK census_g_reg_0_/CK census_g_reg_1_/CK census_g_reg_2_/CK census_g_reg_3_/CK census_g_reg_4_/CK census_g_reg_5_/CK census_g_reg_6_/CK census_g_reg_7_/CK census_r_reg_0_/CK census_r_reg_1_/CK census_r_reg_2_/CK census_r_reg_3_/CK census_r_reg_4_/CK census_r_reg_5_/CK census_r_reg_6_/CK census_r_reg_7_/CK valid_r_reg/CK m_reg_r_reg_4__7_/CK m_reg_r_reg_2__7_/CK m_reg_r_reg_1__7_/CK m_reg_r_reg_4__6_/CK m_reg_r_reg_2__6_/CK m_reg_r_reg_1__6_/CK m_reg_r_reg_4__5_/CK m_reg_r_reg_2__5_/CK m_reg_r_reg_1__5_/CK m_reg_r_reg_4__4_/CK m_reg_r_reg_2__4_/CK m_reg_r_reg_1__4_/CK m_reg_r_reg_4__3_/CK m_reg_r_reg_2__3_/CK m_reg_r_reg_1__3_/CK m_reg_r_reg_4__2_/CK m_reg_r_reg_2__2_/CK m_reg_r_reg_1__2_/CK m_reg_r_reg_4__1_/CK m_reg_r_reg_2__1_/CK m_reg_r_reg_1__1_/CK m_reg_r_reg_4__0_/CK m_reg_r_reg_2__0_/CK m_reg_r_reg_1__0_/CK m_reg_g_reg_4__7_/CK m_reg_g_reg_4__6_/CK m_reg_g_reg_3__6_/CK m_reg_g_reg_4__5_/CK m_reg_g_reg_4__4_/CK m_reg_g_reg_4__3_/CK m_reg_g_reg_4__2_/CK m_reg_g_reg_4__1_/CK m_reg_g_reg_4__0_/CK m_reg_g_reg_3__0_/CK m_reg_b_reg_4__7_/CK m_reg_b_reg_4__6_/CK m_reg_b_reg_4__5_/CK m_reg_b_reg_4__4_/CK m_reg_b_reg_4__3_/CK m_reg_b_reg_4__2_/CK m_reg_b_reg_4__1_/CK m_reg_b_reg_4__0_/CK cstate_reg_1_/CK m_reg_g_reg_1__6_/CK m_reg_g_reg_1__5_/CK m_reg_g_reg_1__7_/CK m_reg_r_reg_3__7_/CK m_reg_g_reg_3__7_/CK m_reg_g_reg_2__7_/CK m_reg_g_reg_1__4_/CK m_reg_r_reg_3__5_/CK m_reg_r_reg_3__6_/CK m_reg_b_reg_2__7_/CK m_reg_g_reg_3__5_/CK m_reg_g_reg_2__5_/CK m_reg_b_reg_3__7_/CK m_reg_g_reg_3__4_/CK m_reg_g_reg_2__6_/CK m_reg_b_reg_3__5_/CK m_reg_b_reg_3__6_/CK m_reg_r_reg_3__4_/CK m_reg_b_reg_2__5_/CK m_reg_g_reg_2__4_/CK valid_rr_reg/CK m_reg_b_reg_3__4_/CK m_reg_b_reg_2__6_/CK m_reg_g_reg_2__3_/CK m_reg_g_reg_1__3_/CK m_reg_g_reg_3__3_/CK m_reg_g_reg_2__2_/CK m_reg_g_reg_1__2_/CK m_reg_b_reg_2__4_/CK m_reg_g_reg_3__2_/CK m_reg_b_reg_3__3_/CK m_reg_g_reg_1__0_/CK m_reg_b_reg_3__2_/CK m_reg_g_reg_1__1_/CK m_reg_r_reg_3__3_/CK m_reg_r_reg_3__2_/CK m_reg_g_reg_3__1_/CK m_reg_r_reg_3__0_/CK m_reg_b_reg_2__3_/CK m_reg_g_reg_2__0_/CK m_reg_g_reg_0__7_/CK m_reg_g_reg_2__1_/CK m_reg_b_reg_0__7_/CK m_reg_b_reg_2__2_/CK m_reg_r_reg_3__1_/CK m_reg_b_reg_3__0_/CK m_reg_b_reg_3__1_/CK m_reg_b_reg_2__0_/CK m_reg_r_reg_0__0_/CK m_reg_g_reg_0__0_/CK m_reg_b_reg_0__0_/CK m_reg_r_reg_0__5_/CK m_reg_b_reg_0__5_/CK m_reg_g_reg_0__5_/CK m_reg_b_reg_2__1_/CK m_reg_r_reg_0__1_/CK m_reg_b_reg_0__1_/CK m_reg_g_reg_0__1_/CK m_reg_r_reg_0__3_/CK m_reg_g_reg_0__3_/CK m_reg_b_reg_0__3_/CK m_reg_b_reg_0__2_/CK m_reg_r_reg_0__2_/CK m_reg_g_reg_0__2_/CK m_reg_r_reg_0__4_/CK m_reg_b_reg_0__4_/CK m_reg_g_reg_0__4_/CK m_reg_r_reg_0__6_/CK m_reg_g_reg_0__6_/CK m_reg_b_reg_0__6_/CK m_reg_r_reg_0__7_/CK ftr_cnt2_reg_1_/CK ftr_cnt2_reg_0_/CK ftr_row_reg_1_/CK img_size_r_reg_4_/CK counter_r_reg_0_/CK m_reg_b_reg_1__7_/CK m_reg_b_reg_1__4_/CK m_reg_b_reg_1__2_/CK m_reg_b_reg_1__1_/CK ftr_zero_pad_r_reg/CK img_origin_r_reg_7_/CK counter_r_reg_1_/CK counter_r_reg_5_/CK cstate_reg_2_/CK m_reg_b_reg_1__5_/CK m_reg_b_reg_1__6_/CK m_reg_b_reg_1__3_/CK m_reg_b_reg_1__0_/CK out_data_r_reg_5_/CK out_data_r_reg_7_/CK cstate_reg_3_/CK img_origin_r_reg_2_/CK ftr_row_reg_0_/CK ftr_col_reg_0_/CK ftr_cnt_reg_1_/CK ftr_cnt_reg_0_/CK ftr_row_reg_2_/CK ftr_col_reg_1_/CK ftr_col_reg_2_/CK counter_r_reg_3_/CK img_origin_r_reg_1_/CK}]  -to $__coll_2  
set __coll_4 [get_pins {mem_mem3/CEN mem_mem3/WEN mem_mem3/A[7] mem_mem3/A[6] mem_mem3/A[5] mem_mem3/A[4] mem_mem3/A[3] mem_mem3/A[2] mem_mem3/A[1] mem_mem3/A[0] mem_mem3/D[7] mem_mem3/D[6] mem_mem3/D[5] mem_mem3/D[4] mem_mem3/D[3] mem_mem3/D[2] mem_mem3/D[1] mem_mem3/D[0] mem_mem2/CEN mem_mem2/WEN mem_mem2/A[7] mem_mem2/A[6] mem_mem2/A[5] mem_mem2/A[4] mem_mem2/A[3] mem_mem2/A[2] mem_mem2/A[1] mem_mem2/A[0] mem_mem2/D[7] mem_mem2/D[6] mem_mem2/D[5] mem_mem2/D[4] mem_mem2/D[3] mem_mem2/D[2] mem_mem2/D[1] mem_mem2/D[0] mem_mem1/CEN mem_mem1/WEN mem_mem1/A[7] mem_mem1/A[6] mem_mem1/A[5] mem_mem1/A[4] mem_mem1/A[3] mem_mem1/A[2] mem_mem1/A[1] mem_mem1/A[0] mem_mem1/D[7] mem_mem1/D[6] mem_mem1/D[5] mem_mem1/D[4] mem_mem1/D[3] mem_mem1/D[2] mem_mem1/D[1] mem_mem1/D[0] img_origin_r_reg_0_/D img_origin_r_reg_0_/RN img_size_r_reg_3_/D img_size_r_reg_3_/RN cstate_reg_0_/D cstate_reg_0_/RN img_size_r_reg_2_/D img_size_r_reg_2_/RN img_size_r_reg_1_/D img_size_r_reg_1_/RN img_size_r_reg_0_/D img_size_r_reg_0_/RN img_origin_r_reg_3_/D img_origin_r_reg_3_/RN img_origin_r_reg_4_/D img_origin_r_reg_4_/RN img_origin_r_reg_5_/D img_origin_r_reg_5_/RN img_origin_r_reg_6_/D img_origin_r_reg_6_/RN counter_r_reg_2_/D counter_r_reg_2_/RN counter_r_reg_4_/D counter_r_reg_4_/RN counter_r_reg_6_/D counter_r_reg_6_/RN counter_r_reg_7_/D counter_r_reg_7_/RN out_data_r_reg_0_/D out_data_r_reg_0_/RN out_data_r_reg_1_/D out_data_r_reg_1_/RN out_data_r_reg_2_/D out_data_r_reg_2_/RN out_data_r_reg_3_/D out_data_r_reg_3_/RN out_data_r_reg_4_/D out_data_r_reg_4_/RN out_data_r_reg_6_/D out_data_r_reg_6_/RN out_data_r_reg_8_/D out_data_r_reg_8_/RN out_data_r_reg_9_/D out_data_r_reg_9_/RN out_data_r_reg_10_/D out_data_r_reg_10_/RN out_data_r_reg_11_/D out_data_r_reg_11_/RN out_data_r_reg_12_/D out_data_r_reg_12_/RN out_data_r_reg_13_/D out_data_r_reg_13_/RN out_data_r_reg_14_/D out_data_r_reg_14_/RN out_data_r_reg_15_/D out_data_r_reg_15_/RN out_data_r_reg_16_/D out_data_r_reg_16_/RN out_data_r_reg_17_/D out_data_r_reg_17_/RN out_data_r_reg_18_/D out_data_r_reg_18_/RN out_data_r_reg_19_/D out_data_r_reg_19_/RN out_data_r_reg_20_/D out_data_r_reg_20_/RN out_data_r_reg_21_/D out_data_r_reg_21_/RN out_data_r_reg_22_/D out_data_r_reg_22_/RN out_data_r_reg_23_/D out_data_r_reg_23_/RN counter_r_reg_8_/D counter_r_reg_8_/RN census_b_reg_0_/D census_b_reg_0_/RN census_b_reg_1_/D census_b_reg_1_/RN census_b_reg_2_/D census_b_reg_2_/RN census_b_reg_3_/D census_b_reg_3_/RN census_b_reg_4_/D census_b_reg_4_/RN census_b_reg_5_/D census_b_reg_5_/RN census_b_reg_6_/D census_b_reg_6_/RN census_b_reg_7_/D census_b_reg_7_/RN census_g_reg_0_/D census_g_reg_0_/RN census_g_reg_1_/D census_g_reg_1_/RN census_g_reg_2_/D census_g_reg_2_/RN census_g_reg_3_/D census_g_reg_3_/RN census_g_reg_4_/D census_g_reg_4_/RN census_g_reg_5_/D census_g_reg_5_/RN census_g_reg_6_/D census_g_reg_6_/RN census_g_reg_7_/D census_g_reg_7_/RN census_r_reg_0_/D census_r_reg_0_/RN census_r_reg_1_/D census_r_reg_1_/RN census_r_reg_2_/D census_r_reg_2_/RN census_r_reg_3_/D census_r_reg_3_/RN census_r_reg_4_/D census_r_reg_4_/RN census_r_reg_5_/D census_r_reg_5_/RN census_r_reg_6_/D census_r_reg_6_/RN census_r_reg_7_/D census_r_reg_7_/RN valid_r_reg/D valid_r_reg/RN m_reg_r_reg_4__7_/D m_reg_r_reg_4__7_/RN m_reg_r_reg_2__7_/D m_reg_r_reg_2__7_/RN m_reg_r_reg_1__7_/D m_reg_r_reg_1__7_/RN m_reg_r_reg_4__6_/D m_reg_r_reg_4__6_/RN m_reg_r_reg_2__6_/D m_reg_r_reg_2__6_/RN m_reg_r_reg_1__6_/D m_reg_r_reg_1__6_/RN m_reg_r_reg_4__5_/D m_reg_r_reg_4__5_/RN m_reg_r_reg_2__5_/D m_reg_r_reg_2__5_/RN m_reg_r_reg_1__5_/D m_reg_r_reg_1__5_/RN m_reg_r_reg_4__4_/D m_reg_r_reg_4__4_/RN m_reg_r_reg_2__4_/D m_reg_r_reg_2__4_/RN m_reg_r_reg_1__4_/D m_reg_r_reg_1__4_/RN m_reg_r_reg_4__3_/D m_reg_r_reg_4__3_/RN m_reg_r_reg_2__3_/D m_reg_r_reg_2__3_/RN m_reg_r_reg_1__3_/D m_reg_r_reg_1__3_/RN m_reg_r_reg_4__2_/D m_reg_r_reg_4__2_/RN m_reg_r_reg_2__2_/D m_reg_r_reg_2__2_/RN m_reg_r_reg_1__2_/D m_reg_r_reg_1__2_/RN m_reg_r_reg_4__1_/D m_reg_r_reg_4__1_/RN m_reg_r_reg_2__1_/D m_reg_r_reg_2__1_/RN m_reg_r_reg_1__1_/D m_reg_r_reg_1__1_/RN m_reg_r_reg_4__0_/D m_reg_r_reg_4__0_/RN m_reg_r_reg_2__0_/D m_reg_r_reg_2__0_/RN m_reg_r_reg_1__0_/D m_reg_r_reg_1__0_/RN m_reg_g_reg_4__7_/D m_reg_g_reg_4__7_/RN m_reg_g_reg_4__6_/D m_reg_g_reg_4__6_/RN m_reg_g_reg_3__6_/D m_reg_g_reg_3__6_/RN m_reg_g_reg_4__5_/D m_reg_g_reg_4__5_/RN m_reg_g_reg_4__4_/D m_reg_g_reg_4__4_/RN m_reg_g_reg_4__3_/D m_reg_g_reg_4__3_/RN m_reg_g_reg_4__2_/D m_reg_g_reg_4__2_/RN m_reg_g_reg_4__1_/D m_reg_g_reg_4__1_/RN m_reg_g_reg_4__0_/D m_reg_g_reg_4__0_/RN m_reg_g_reg_3__0_/D m_reg_g_reg_3__0_/RN m_reg_b_reg_4__7_/D m_reg_b_reg_4__7_/RN m_reg_b_reg_4__6_/D m_reg_b_reg_4__6_/RN m_reg_b_reg_4__5_/D m_reg_b_reg_4__5_/RN m_reg_b_reg_4__4_/D m_reg_b_reg_4__4_/RN m_reg_b_reg_4__3_/D m_reg_b_reg_4__3_/RN m_reg_b_reg_4__2_/D m_reg_b_reg_4__2_/RN m_reg_b_reg_4__1_/D m_reg_b_reg_4__1_/RN m_reg_b_reg_4__0_/D m_reg_b_reg_4__0_/RN cstate_reg_1_/D cstate_reg_1_/SN m_reg_g_reg_1__6_/D m_reg_g_reg_1__6_/RN m_reg_g_reg_1__5_/D m_reg_g_reg_1__5_/RN m_reg_g_reg_1__7_/D m_reg_g_reg_1__7_/RN m_reg_r_reg_3__7_/D m_reg_r_reg_3__7_/RN m_reg_g_reg_3__7_/D m_reg_g_reg_3__7_/RN m_reg_g_reg_2__7_/D m_reg_g_reg_2__7_/RN m_reg_g_reg_1__4_/D m_reg_g_reg_1__4_/RN m_reg_r_reg_3__5_/D m_reg_r_reg_3__5_/RN m_reg_r_reg_3__6_/D m_reg_r_reg_3__6_/RN m_reg_b_reg_2__7_/D m_reg_b_reg_2__7_/RN m_reg_g_reg_3__5_/D m_reg_g_reg_3__5_/RN m_reg_g_reg_2__5_/D m_reg_g_reg_2__5_/RN m_reg_b_reg_3__7_/D m_reg_b_reg_3__7_/RN m_reg_g_reg_3__4_/D m_reg_g_reg_3__4_/RN m_reg_g_reg_2__6_/D m_reg_g_reg_2__6_/RN m_reg_b_reg_3__5_/D m_reg_b_reg_3__5_/RN m_reg_b_reg_3__6_/D m_reg_b_reg_3__6_/RN m_reg_r_reg_3__4_/D m_reg_r_reg_3__4_/RN m_reg_b_reg_2__5_/D m_reg_b_reg_2__5_/RN m_reg_g_reg_2__4_/D m_reg_g_reg_2__4_/RN valid_rr_reg/D valid_rr_reg/RN m_reg_b_reg_3__4_/D m_reg_b_reg_3__4_/RN m_reg_b_reg_2__6_/D m_reg_b_reg_2__6_/RN m_reg_g_reg_2__3_/D m_reg_g_reg_2__3_/RN m_reg_g_reg_1__3_/D m_reg_g_reg_1__3_/RN m_reg_g_reg_3__3_/D m_reg_g_reg_3__3_/RN m_reg_g_reg_2__2_/D m_reg_g_reg_2__2_/RN m_reg_g_reg_1__2_/D m_reg_g_reg_1__2_/RN m_reg_b_reg_2__4_/D m_reg_b_reg_2__4_/RN m_reg_g_reg_3__2_/D m_reg_g_reg_3__2_/RN m_reg_b_reg_3__3_/D m_reg_b_reg_3__3_/RN m_reg_g_reg_1__0_/D m_reg_g_reg_1__0_/RN m_reg_b_reg_3__2_/D m_reg_b_reg_3__2_/RN m_reg_g_reg_1__1_/D m_reg_g_reg_1__1_/RN m_reg_r_reg_3__3_/D m_reg_r_reg_3__3_/RN m_reg_r_reg_3__2_/D m_reg_r_reg_3__2_/RN m_reg_g_reg_3__1_/D m_reg_g_reg_3__1_/RN m_reg_r_reg_3__0_/D m_reg_r_reg_3__0_/RN m_reg_b_reg_2__3_/D m_reg_b_reg_2__3_/RN m_reg_g_reg_2__0_/D m_reg_g_reg_2__0_/RN m_reg_g_reg_0__7_/D m_reg_g_reg_0__7_/RN m_reg_g_reg_2__1_/D m_reg_g_reg_2__1_/RN m_reg_b_reg_0__7_/D m_reg_b_reg_0__7_/RN m_reg_b_reg_2__2_/D m_reg_b_reg_2__2_/RN m_reg_r_reg_3__1_/D m_reg_r_reg_3__1_/RN m_reg_b_reg_3__0_/D m_reg_b_reg_3__0_/RN m_reg_b_reg_3__1_/D m_reg_b_reg_3__1_/RN m_reg_b_reg_2__0_/D m_reg_b_reg_2__0_/RN m_reg_r_reg_0__0_/D m_reg_r_reg_0__0_/RN m_reg_g_reg_0__0_/D m_reg_g_reg_0__0_/RN m_reg_b_reg_0__0_/D m_reg_b_reg_0__0_/RN m_reg_r_reg_0__5_/D m_reg_r_reg_0__5_/RN m_reg_b_reg_0__5_/D m_reg_b_reg_0__5_/RN m_reg_g_reg_0__5_/D m_reg_g_reg_0__5_/RN m_reg_b_reg_2__1_/D m_reg_b_reg_2__1_/RN m_reg_r_reg_0__1_/D m_reg_r_reg_0__1_/RN m_reg_b_reg_0__1_/D m_reg_b_reg_0__1_/RN m_reg_g_reg_0__1_/D m_reg_g_reg_0__1_/RN m_reg_r_reg_0__3_/D m_reg_r_reg_0__3_/RN m_reg_g_reg_0__3_/D m_reg_g_reg_0__3_/RN m_reg_b_reg_0__3_/D m_reg_b_reg_0__3_/RN m_reg_b_reg_0__2_/D m_reg_b_reg_0__2_/RN}]
append_to_collection __coll_4 [get_pins {m_reg_r_reg_0__2_/D m_reg_r_reg_0__2_/RN m_reg_g_reg_0__2_/D m_reg_g_reg_0__2_/RN m_reg_r_reg_0__4_/D m_reg_r_reg_0__4_/RN m_reg_b_reg_0__4_/D m_reg_b_reg_0__4_/RN m_reg_g_reg_0__4_/D m_reg_g_reg_0__4_/RN m_reg_r_reg_0__6_/D m_reg_r_reg_0__6_/RN m_reg_g_reg_0__6_/D m_reg_g_reg_0__6_/RN m_reg_b_reg_0__6_/D m_reg_b_reg_0__6_/RN m_reg_r_reg_0__7_/D m_reg_r_reg_0__7_/RN ftr_cnt2_reg_1_/D ftr_cnt2_reg_1_/RN ftr_cnt2_reg_0_/D ftr_cnt2_reg_0_/RN ftr_row_reg_1_/D ftr_row_reg_1_/RN img_size_r_reg_4_/D img_size_r_reg_4_/RN counter_r_reg_0_/D counter_r_reg_0_/RN m_reg_b_reg_1__7_/D m_reg_b_reg_1__7_/RN m_reg_b_reg_1__4_/D m_reg_b_reg_1__4_/RN m_reg_b_reg_1__2_/D m_reg_b_reg_1__2_/RN m_reg_b_reg_1__1_/D m_reg_b_reg_1__1_/RN ftr_zero_pad_r_reg/D ftr_zero_pad_r_reg/RN img_origin_r_reg_7_/D img_origin_r_reg_7_/RN counter_r_reg_1_/D counter_r_reg_1_/RN counter_r_reg_5_/D counter_r_reg_5_/RN cstate_reg_2_/D cstate_reg_2_/RN m_reg_b_reg_1__5_/D m_reg_b_reg_1__5_/RN m_reg_b_reg_1__6_/D m_reg_b_reg_1__6_/RN m_reg_b_reg_1__3_/D m_reg_b_reg_1__3_/RN m_reg_b_reg_1__0_/D m_reg_b_reg_1__0_/RN out_data_r_reg_5_/D out_data_r_reg_5_/RN out_data_r_reg_7_/D out_data_r_reg_7_/RN cstate_reg_3_/D cstate_reg_3_/SN img_origin_r_reg_2_/D img_origin_r_reg_2_/RN ftr_row_reg_0_/D ftr_col_reg_0_/D ftr_cnt_reg_1_/D ftr_cnt_reg_0_/D ftr_row_reg_2_/D ftr_col_reg_1_/D ftr_col_reg_2_/D counter_r_reg_3_/D counter_r_reg_3_/RN img_origin_r_reg_1_/D img_origin_r_reg_1_/RN}]
group_path -name in2reg -from [get_ports {i_clk i_rst_n i_op_valid i_op_mode[3] i_op_mode[2] i_op_mode[1] i_op_mode[0] i_in_valid i_in_data[23] i_in_data[22] i_in_data[21] i_in_data[20] i_in_data[19] i_in_data[18] i_in_data[17] i_in_data[16] i_in_data[15] i_in_data[14] i_in_data[13] i_in_data[12] i_in_data[11] i_in_data[10] i_in_data[9] i_in_data[8] i_in_data[7] i_in_data[6] i_in_data[5] i_in_data[4] i_in_data[3] i_in_data[2] i_in_data[1] i_in_data[0]}]  -to $__coll_4  
group_path -name in2out -from [get_ports {i_clk i_rst_n i_op_valid i_op_mode[3] i_op_mode[2] i_op_mode[1] i_op_mode[0] i_in_valid i_in_data[23] i_in_data[22] i_in_data[21] i_in_data[20] i_in_data[19] i_in_data[18] i_in_data[17] i_in_data[16] i_in_data[15] i_in_data[14] i_in_data[13] i_in_data[12] i_in_data[11] i_in_data[10] i_in_data[9] i_in_data[8] i_in_data[7] i_in_data[6] i_in_data[5] i_in_data[4] i_in_data[3] i_in_data[2] i_in_data[1] i_in_data[0]}]  -to [get_ports {o_op_ready o_in_ready o_out_valid o_out_data[23] o_out_data[22] o_out_data[21] o_out_data[20] o_out_data[19] o_out_data[18] o_out_data[17] o_out_data[16] o_out_data[15] o_out_data[14] o_out_data[13] o_out_data[12] o_out_data[11] o_out_data[10] o_out_data[9] o_out_data[8] o_out_data[7] o_out_data[6] o_out_data[5] o_out_data[4] o_out_data[3] o_out_data[2] o_out_data[1] o_out_data[0]}] 
group_path -name reg2out -from [get_pins {mem_mem3/CLK mem_mem2/CLK mem_mem1/CLK img_origin_r_reg_0_/CK img_size_r_reg_3_/CK cstate_reg_0_/CK img_size_r_reg_2_/CK img_size_r_reg_1_/CK img_size_r_reg_0_/CK img_origin_r_reg_3_/CK img_origin_r_reg_4_/CK img_origin_r_reg_5_/CK img_origin_r_reg_6_/CK counter_r_reg_2_/CK counter_r_reg_4_/CK counter_r_reg_6_/CK counter_r_reg_7_/CK out_data_r_reg_0_/CK out_data_r_reg_1_/CK out_data_r_reg_2_/CK out_data_r_reg_3_/CK out_data_r_reg_4_/CK out_data_r_reg_6_/CK out_data_r_reg_8_/CK out_data_r_reg_9_/CK out_data_r_reg_10_/CK out_data_r_reg_11_/CK out_data_r_reg_12_/CK out_data_r_reg_13_/CK out_data_r_reg_14_/CK out_data_r_reg_15_/CK out_data_r_reg_16_/CK out_data_r_reg_17_/CK out_data_r_reg_18_/CK out_data_r_reg_19_/CK out_data_r_reg_20_/CK out_data_r_reg_21_/CK out_data_r_reg_22_/CK out_data_r_reg_23_/CK counter_r_reg_8_/CK census_b_reg_0_/CK census_b_reg_1_/CK census_b_reg_2_/CK census_b_reg_3_/CK census_b_reg_4_/CK census_b_reg_5_/CK census_b_reg_6_/CK census_b_reg_7_/CK census_g_reg_0_/CK census_g_reg_1_/CK census_g_reg_2_/CK census_g_reg_3_/CK census_g_reg_4_/CK census_g_reg_5_/CK census_g_reg_6_/CK census_g_reg_7_/CK census_r_reg_0_/CK census_r_reg_1_/CK census_r_reg_2_/CK census_r_reg_3_/CK census_r_reg_4_/CK census_r_reg_5_/CK census_r_reg_6_/CK census_r_reg_7_/CK valid_r_reg/CK m_reg_r_reg_4__7_/CK m_reg_r_reg_2__7_/CK m_reg_r_reg_1__7_/CK m_reg_r_reg_4__6_/CK m_reg_r_reg_2__6_/CK m_reg_r_reg_1__6_/CK m_reg_r_reg_4__5_/CK m_reg_r_reg_2__5_/CK m_reg_r_reg_1__5_/CK m_reg_r_reg_4__4_/CK m_reg_r_reg_2__4_/CK m_reg_r_reg_1__4_/CK m_reg_r_reg_4__3_/CK m_reg_r_reg_2__3_/CK m_reg_r_reg_1__3_/CK m_reg_r_reg_4__2_/CK m_reg_r_reg_2__2_/CK m_reg_r_reg_1__2_/CK m_reg_r_reg_4__1_/CK m_reg_r_reg_2__1_/CK m_reg_r_reg_1__1_/CK m_reg_r_reg_4__0_/CK m_reg_r_reg_2__0_/CK m_reg_r_reg_1__0_/CK m_reg_g_reg_4__7_/CK m_reg_g_reg_4__6_/CK m_reg_g_reg_3__6_/CK m_reg_g_reg_4__5_/CK m_reg_g_reg_4__4_/CK m_reg_g_reg_4__3_/CK m_reg_g_reg_4__2_/CK m_reg_g_reg_4__1_/CK m_reg_g_reg_4__0_/CK m_reg_g_reg_3__0_/CK m_reg_b_reg_4__7_/CK m_reg_b_reg_4__6_/CK m_reg_b_reg_4__5_/CK m_reg_b_reg_4__4_/CK m_reg_b_reg_4__3_/CK m_reg_b_reg_4__2_/CK m_reg_b_reg_4__1_/CK m_reg_b_reg_4__0_/CK cstate_reg_1_/CK m_reg_g_reg_1__6_/CK m_reg_g_reg_1__5_/CK m_reg_g_reg_1__7_/CK m_reg_r_reg_3__7_/CK m_reg_g_reg_3__7_/CK m_reg_g_reg_2__7_/CK m_reg_g_reg_1__4_/CK m_reg_r_reg_3__5_/CK m_reg_r_reg_3__6_/CK m_reg_b_reg_2__7_/CK m_reg_g_reg_3__5_/CK m_reg_g_reg_2__5_/CK m_reg_b_reg_3__7_/CK m_reg_g_reg_3__4_/CK m_reg_g_reg_2__6_/CK m_reg_b_reg_3__5_/CK m_reg_b_reg_3__6_/CK m_reg_r_reg_3__4_/CK m_reg_b_reg_2__5_/CK m_reg_g_reg_2__4_/CK valid_rr_reg/CK m_reg_b_reg_3__4_/CK m_reg_b_reg_2__6_/CK m_reg_g_reg_2__3_/CK m_reg_g_reg_1__3_/CK m_reg_g_reg_3__3_/CK m_reg_g_reg_2__2_/CK m_reg_g_reg_1__2_/CK m_reg_b_reg_2__4_/CK m_reg_g_reg_3__2_/CK m_reg_b_reg_3__3_/CK m_reg_g_reg_1__0_/CK m_reg_b_reg_3__2_/CK m_reg_g_reg_1__1_/CK m_reg_r_reg_3__3_/CK m_reg_r_reg_3__2_/CK m_reg_g_reg_3__1_/CK m_reg_r_reg_3__0_/CK m_reg_b_reg_2__3_/CK m_reg_g_reg_2__0_/CK m_reg_g_reg_0__7_/CK m_reg_g_reg_2__1_/CK m_reg_b_reg_0__7_/CK m_reg_b_reg_2__2_/CK m_reg_r_reg_3__1_/CK m_reg_b_reg_3__0_/CK m_reg_b_reg_3__1_/CK m_reg_b_reg_2__0_/CK m_reg_r_reg_0__0_/CK m_reg_g_reg_0__0_/CK m_reg_b_reg_0__0_/CK m_reg_r_reg_0__5_/CK m_reg_b_reg_0__5_/CK m_reg_g_reg_0__5_/CK m_reg_b_reg_2__1_/CK m_reg_r_reg_0__1_/CK m_reg_b_reg_0__1_/CK m_reg_g_reg_0__1_/CK m_reg_r_reg_0__3_/CK m_reg_g_reg_0__3_/CK m_reg_b_reg_0__3_/CK m_reg_b_reg_0__2_/CK m_reg_r_reg_0__2_/CK m_reg_g_reg_0__2_/CK m_reg_r_reg_0__4_/CK m_reg_b_reg_0__4_/CK m_reg_g_reg_0__4_/CK m_reg_r_reg_0__6_/CK m_reg_g_reg_0__6_/CK m_reg_b_reg_0__6_/CK m_reg_r_reg_0__7_/CK ftr_cnt2_reg_1_/CK ftr_cnt2_reg_0_/CK ftr_row_reg_1_/CK img_size_r_reg_4_/CK counter_r_reg_0_/CK m_reg_b_reg_1__7_/CK m_reg_b_reg_1__4_/CK m_reg_b_reg_1__2_/CK m_reg_b_reg_1__1_/CK ftr_zero_pad_r_reg/CK img_origin_r_reg_7_/CK counter_r_reg_1_/CK counter_r_reg_5_/CK cstate_reg_2_/CK m_reg_b_reg_1__5_/CK m_reg_b_reg_1__6_/CK m_reg_b_reg_1__3_/CK m_reg_b_reg_1__0_/CK out_data_r_reg_5_/CK out_data_r_reg_7_/CK cstate_reg_3_/CK img_origin_r_reg_2_/CK ftr_row_reg_0_/CK ftr_col_reg_0_/CK ftr_cnt_reg_1_/CK ftr_cnt_reg_0_/CK ftr_row_reg_2_/CK ftr_col_reg_1_/CK ftr_col_reg_2_/CK counter_r_reg_3_/CK img_origin_r_reg_1_/CK}]  -to [get_ports {o_op_ready o_in_ready o_out_valid o_out_data[23] o_out_data[22] o_out_data[21] o_out_data[20] o_out_data[19] o_out_data[18] o_out_data[17] o_out_data[16] o_out_data[15] o_out_data[14] o_out_data[13] o_out_data[12] o_out_data[11] o_out_data[10] o_out_data[9] o_out_data[8] o_out_data[7] o_out_data[6] o_out_data[5] o_out_data[4] o_out_data[3] o_out_data[2] o_out_data[1] o_out_data[0]}] 
