###############################################################
#  Generated by:      Cadence Innovus 20.10-p004_1
#  OS:                Linux x86_64(Host ID cad29)
#  Generated on:      Tue Dec 21 15:47:34 2021
#  Design:            CHIP
#  Command:           update_constraint_mode -name scan_mode -sdc_files design_data/CHIP_scan_cts.sdc
###############################################################
current_design CHIP
create_clock [get_ports {CLK}]  -name CLK1 -period 10.000000 -waveform {0.000000 5.000000}
set_drive 0.1  [get_ports {CLK}]
set_drive 0.1  [get_ports {HALT}]
set_drive 0.1  [get_ports {RESET_}]
set_drive 0.1  [get_ports {DoDCT}]
set_drive 0.1  [get_ports {X[11]}]
set_drive 0.1  [get_ports {X[10]}]
set_drive 0.1  [get_ports {X[9]}]
set_drive 0.1  [get_ports {X[8]}]
set_drive 0.1  [get_ports {X[7]}]
set_drive 0.1  [get_ports {X[6]}]
set_drive 0.1  [get_ports {X[5]}]
set_drive 0.1  [get_ports {X[4]}]
set_drive 0.1  [get_ports {X[3]}]
set_drive 0.1  [get_ports {X[2]}]
set_drive 0.1  [get_ports {X[1]}]
set_drive 0.1  [get_ports {X[0]}]
set_load -pin_load -max  1  [get_ports {Z[11]}]
set_load -pin_load -min  1  [get_ports {Z[11]}]
set_load -pin_load -max  1  [get_ports {Z[10]}]
set_load -pin_load -min  1  [get_ports {Z[10]}]
set_load -pin_load -max  1  [get_ports {Z[9]}]
set_load -pin_load -min  1  [get_ports {Z[9]}]
set_load -pin_load -max  1  [get_ports {Z[8]}]
set_load -pin_load -min  1  [get_ports {Z[8]}]
set_load -pin_load -max  1  [get_ports {Z[7]}]
set_load -pin_load -min  1  [get_ports {Z[7]}]
set_load -pin_load -max  1  [get_ports {Z[6]}]
set_load -pin_load -min  1  [get_ports {Z[6]}]
set_load -pin_load -max  1  [get_ports {Z[5]}]
set_load -pin_load -min  1  [get_ports {Z[5]}]
set_load -pin_load -max  1  [get_ports {Z[4]}]
set_load -pin_load -min  1  [get_ports {Z[4]}]
set_load -pin_load -max  1  [get_ports {Z[3]}]
set_load -pin_load -min  1  [get_ports {Z[3]}]
set_load -pin_load -max  1  [get_ports {Z[2]}]
set_load -pin_load -min  1  [get_ports {Z[2]}]
set_load -pin_load -max  1  [get_ports {Z[1]}]
set_load -pin_load -min  1  [get_ports {Z[1]}]
set_load -pin_load -max  1  [get_ports {Z[0]}]
set_load -pin_load -min  1  [get_ports {Z[0]}]
set_drive 0.1  [get_ports {Mode}]
set_drive 0.1  [get_ports {SCAN_IN}]
set_load -pin_load -max  1  [get_ports {SCAN_OUT}]
set_load -pin_load -min  1  [get_ports {SCAN_OUT}]
set_drive 0.1  [get_ports {SCAN_EN}]
set_case_analysis 0 [get_ports {SCAN_EN}]
set_max_fanout 15  [get_designs {CHIP}]
set_max_transition 2.7  [get_designs {CHIP}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {RESET_}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[1]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[10]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {DoDCT}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {HALT}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[8]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[6]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[2]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[11]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[9]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {SCAN_IN}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[7]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[5]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {SCAN_EN}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {X[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Mode}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {SCAN_OUT}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[10]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {CLK1}] [get_ports {Z[4]}]
set_false_path  -from [get_ports {DoDCT RESET_ Mode}] 
